# CannotCopyNoReferences Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyNoReferences Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Elements can't be copied because they will lose their References.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyNoReferences { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyNoReferences As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyNoReferences {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace